<div class="categories-content categories-content-edit d-flex align-items-center" id="spare_type_sel"
     action="{{ route('sel-spare-store',app()->getLocale()) }}">
{{--        @if(\Request::session()->has('post_canceled') && \Request::session()->get('post_canceled') != NULL)--}}
{{--            <!-- Response -->--}}
{{--                <div class="alert alert-success text-center w-100" role="alert">--}}
{{--                    <strong><i class="fa fa-check"></i> {{ translating('post-creating-process-canceled') }}</strong>--}}
{{--                </div>--}}

{{--                <!-- Clear session -->--}}
{{--            @php \Request::session()->forget('post_canceled'); @endphp--}}
{{--            --}}{{--            @php \Request::session()->forget('post_has_service'); @endphp--}}
{{--        @endif--}}

<!-- Navigation -->
    <div class="mt-5 app-container app-container-create">
        <div class="row title-select-type">
            <div class="col-xl-8 col-lg-8 col-md-8 col-8 title-select-type-col">
                <h5>{{ translating('sel-spare-store') }}</h5>
            </div>
        </div>
        <div class="row post-types-row store_spare_types">
            <div class="col-xl-3 col-md-4 col-lg-3 col-9 single_type d-flex">
                <svg xmlns="http://www.w3.org/2000/svg" width="50.253" height="40" viewBox="0 0 30.253 30" class="sel_spare_store_type" data-type="0">
                    <g id="repairing-tools" transform="translate(-6.845 -0.996)">
                        <rect id="Прямоугольник_983" data-name="Прямоугольник 983" width="1.991" height="3.839"
                              transform="translate(12.78 3.962)" fill="#3b99f6"/>
                        <path id="Контур_670" data-name="Контур 670"
                              d="M17.164,11.166a1.73,1.73,0,0,0-.224-1.789l.507-.313A11.535,11.535,0,0,0,14.928,1h-.785a11.534,11.534,0,0,0-2.519,8.064l.507.313a1.73,1.73,0,0,0-.224,1.789l-.507.313v2.1l1.088,4.054,1.371-2.564.089-2.31L13.9,7.529l.313-3.443h.636l.313,3.443-.045,5.232.089,2.31,1.371,2.564,1.088-4.054v-2.1Z"
                              transform="translate(-0.76 -0.001)" fill="#3b99f6"/>
                        <circle id="Эллипс_35" data-name="Эллипс 35" cx="3.024" cy="3.024" r="3.024"
                                transform="translate(10.752 7.538)" fill="#3b99f6"/>
                        <path id="Контур_671" data-name="Контур 671"
                              d="M13.729,8.947a2.957,2.957,0,0,1,3.735,3.744,3.141,3.141,0,0,0-3.735-3.744Zm1.646,5.833a2.959,2.959,0,0,1-3.744-3.744,3.143,3.143,0,0,0,3.744,3.744Z"
                              transform="translate(-0.772 -1.3)" fill="#3b99f6"/>
                        <path id="Контур_672" data-name="Контур 672"
                              d="M11.972,21.679c-3.293,7.113-1.731,18.252-1.731,18.252.452,3.914-1.684,3.566-1.684,3.566-1.675.019-1.195-2.136-1.195-2.136.489-1.176-.179-10.17-.179-10.17A26.534,26.534,0,0,1,9.018,20.315a2.58,2.58,0,0,0-.461-3.067.421.421,0,0,1,.009-.6,2.949,2.949,0,0,1,2.145-.546l1.317,4.958A.888.888,0,0,1,11.972,21.679Z"
                              transform="translate(-0.048 -2.516)" fill="#3b99f6"/>
                        <path id="Контур_673" data-name="Контур 673"
                              d="M8.57,35.238a37.25,37.25,0,0,1-1.12,9.634c-.668-.574-.376-1.882-.376-1.882C7.563,41.815,6.9,32.82,6.9,32.82a24.011,24.011,0,0,1,.621-6.971A37.857,37.857,0,0,1,8.57,35.238Z"
                              transform="translate(0 -4.146)" fill="#3b99f6"/>
                        <path id="Контур_674" data-name="Контур 674"
                              d="M17.389,21.679c3.293,7.113,1.731,18.252,1.731,18.252C18.669,43.844,20.8,43.5,20.8,43.5,22.479,43.515,22,41.361,22,41.361c-.489-1.176.179-10.17.179-10.17a26.536,26.536,0,0,0-1.835-10.876,2.58,2.58,0,0,1,.461-3.067.421.421,0,0,0-.009-.6A2.949,2.949,0,0,0,18.65,16.1l-1.317,4.958A.888.888,0,0,0,17.389,21.679Z"
                              transform="translate(-1.744 -2.516)" fill="#3b99f6"/>
                        <path id="Контур_675" data-name="Контур 675"
                              d="M21.412,35.238a37.25,37.25,0,0,0,1.12,9.634c.668-.574.376-1.882.376-1.882-.489-1.176.179-10.17.179-10.17a24.011,24.011,0,0,0-.621-6.971A37.857,37.857,0,0,0,21.412,35.238Z"
                              transform="translate(-2.43 -4.146)" fill="#3b99f6"/>
                        <path id="Контур_676" data-name="Контур 676" d="M15.261,1l-.122,2.079L15.017,1Z"
                              transform="translate(-1.363 0)" fill="#3b99f6"/>
                        <path id="Контур_677" data-name="Контур 677"
                              d="M16.8,20.457,15.43,17.888a4.284,4.284,0,0,1,.894,1.176A4.21,4.21,0,0,1,16.8,20.457Zm-2.728-2.568L12.7,20.457a4.436,4.436,0,0,1,.48-1.392A4.279,4.279,0,0,1,14.076,17.888Z"
                              transform="translate(-0.977 -2.818)" fill="#3b99f6"/>
                        <path id="Контур_678" data-name="Контур 678"
                              d="M39.648,6.372a.326.326,0,0,1-.466.138,13.586,13.586,0,0,0-5.079-2,1.576,1.576,0,0,0-1.718,1.578V7.136H28.521V6.17A2.076,2.076,0,0,0,27.154,4.2a2.938,2.938,0,0,0-2.59.37H22.692a.368.368,0,0,1-.368-.368V1.581a.367.367,0,0,1,.368-.368h1.872s1.36,1.576,3.534.01a1.248,1.248,0,0,1,.9-.216A19.624,19.624,0,0,1,39.578,5.992.327.327,0,0,1,39.648,6.372Z"
                              transform="translate(-2.582 0)" fill="#3b99f6"/>
                        <path id="Контур_679" data-name="Контур 679"
                              d="M33.537,8.367l-.663,14.175-3.641-2.694c.032-.537.053-1.084.074-1.621l.368-9.861h3.862Z"
                              transform="translate(-3.735 -1.23)" fill="#3b99f6"/>
                        <path id="Контур_680" data-name="Контур 680"
                              d="M32.073,36.541a61.458,61.458,0,0,0-.231,7.146c.037,1.226-2.967,1.15-4.452-.547a.742.742,0,0,1-.042-.916c2.3-3.394.222-5.94,1.168-15.007.179-1.694.284-3.389.368-5.083l3.652,2.7C32.684,27.2,32.073,36.541,32.073,36.541Z"
                              transform="translate(-3.398 -3.526)" fill="#3b99f6"/>
                        <path id="Контур_681" data-name="Контур 681"
                              d="M32.073,36.541a61.458,61.458,0,0,0-.231,7.146c.037,1.226-2.967,1.15-4.452-.547a.742.742,0,0,1-.042-.916c2.3-3.394.222-5.94,1.168-15.007.179-1.694.284-3.389.368-5.083l3.652,2.7C32.684,27.2,32.073,36.541,32.073,36.541Z"
                              transform="translate(-3.398 -3.526)" fill="#3b99f6"/>
                        <path id="Контур_682" data-name="Контур 682"
                              d="M29.217,22.145c-.01.421-.042.842-.074,1.263.021-.431.042-.852.063-1.273Z"
                              transform="translate(-3.72 -3.526)" fill="#3b99f6"/>
                        <path id="Контур_683" data-name="Контур 683"
                              d="M31.286,48.526a3.794,3.794,0,0,1-3.557-1.01l.979-.726L31,47.169Z"
                              transform="translate(-3.484 -7.639)" fill="#3b99f6"/>
                        <path id="Контур_684" data-name="Контур 684"
                              d="M24.986,1.256a13.3,13.3,0,0,1,0,3.357A13.291,13.291,0,0,1,24.986,1.256Z"
                              transform="translate(-3.009 -0.043)" fill="#3b99f6"/>
                    </g>
                </svg>
                <a class="sel_spare_store_type" data-type="0">Պահեստամասերի Կենտրոն</a>
            </div>
            <div
                class="col-xl-3 col-md-4 col-lg-3 col-9 mt-lg-0 mt-xl-0 mt-md-0 mt-2 ml-0 ml-xl-3 ml-lg-3 ml-md-3 single_type d-flex">
                <svg xmlns="http://www.w3.org/2000/svg" width="47.107" height="45" viewBox="0 0 33.107 40" class="sel_spare_store_type" data-type="1">
                    <path id="_17676289951537184110" data-name="17676289951537184110"
                          d="M51.093,38.329,48.659,11.223a1.436,1.436,0,0,0-1.43-1.307H42.209V7.652a7.651,7.651,0,1,0-15.3,0V9.915H21.884a1.436,1.436,0,0,0-1.43,1.307L18.011,38.436A1.436,1.436,0,0,0,19.441,40H49.676a1.436,1.436,0,0,0,1.436-1.436A1.463,1.463,0,0,0,51.093,38.329ZM29.779,7.652a4.78,4.78,0,1,1,9.559,0V9.915H29.779ZM21.011,37.129,23.2,12.787h3.71v2.567a1.436,1.436,0,0,0,2.871,0V12.787h9.559v2.567a1.436,1.436,0,0,0,2.871,0V12.787h3.707L48.1,37.129H21.011Z"
                          transform="translate(-18.005)" fill="#3b99f6"/>
                </svg>
                <a class="sel_spare_store_type" data-type="1">Խանութ</a>
            </div>

        </div>
        <div class="mt-3 row w-100">
            <input type="hidden" name="spare_store_post_type" value="">
        {{--                    <input type="hidden" name="category_id" value="">--}}
        <!-- <button class="selectcategory btn btn-main text-light btn-lg">{{ translating('continue') }}</button> -->
        </div>
    </div>
</div>
